/*
编写程序计算运费。要求程序运行时，从键盘输入运输距离，计算并输出运费（结果保留两位小数）。
没有折扣情况下，每运输一个单位的距离，运费为10。标
准如下：距离用s表示： 
当s<0时，输出error!；
当0<=s<250时，没有折扣；
当250<=s<500时，%2折扣；
当500<=s<1000时，%5折扣；
当1000<=s<2000时，%8折扣；
当2000<=s<3000时，%10折扣；
当3000<=s时，%15折扣。
*/ 

#include <stdio.h>                                        
int main()                                                  

{
	int s,i = 0;
	printf("输入运输距离 ：");
	scanf("%d",&s);
	if(s < 0) 
	printf("error!");
	else if(s >= 0 && s < 250)
	{
		i += s * 10;
		printf("运费 = %..2d",i);
	} 
	else if(s >=250 && s < 500)
	{
		i += s * 10 * (1 - 0.02);
		printf("运费 = %.2d",i);
	}
	else if(s >=500 && s < 1000)
	{
		i += s * 10 * (1 - 0.05);
		printf("运费 = %.2d",i);
    }
    else if(s >=1000 && s < 2000)
    {
    	i += s * 10 * (1 - 0.08);
		printf("运费 = %.2d",i);
	}
	else if(s >=2000 && s < 3000)
    {
i += s * 10 * (1 - 0.1);
		printf("运费 = %.2d",i);
	}
	else
	{
    	i += s * 10 * (1 - 0.15);
		printf("运费 = %.2d",i);
	}
	return 0;
}

